app/controllers/histories_controller.rb

  def index
    @histories = History.all
---
SELECT "histories".* FROM "histories"